Revit 2024 API
BuiltInFailures.MEPFabricationFailures.PinnedFabricationPartNotChangeExtension Property
 Failed to change extension of part.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId PinnedFabricationPartNotChangeExtension { get; }
Visual Basic
Public Shared ReadOnly Property PinnedFabricationPartNotChangeExtension As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ PinnedFabricationPartNotChangeExtension {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.MEPFabricationFailures Class
Autodesk.Revit.DB Namespace